vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFM32JG1B_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>EFM32JG1B_DFP</name>
  <description>Silicon Labs EFM32 Jade Gecko Series Device Support</description>

  <releases>
    <release version="1.2.0" date="2018-01-15" deprecated="2018-01-15" replacement="SiliconLabs.EFM32JG1B_DFP">
      The maintenance of this pack will be discontinued and SiliconLabs is providing the new pack SiliconLabs.EFM32JG1B_DFP.
    </release>
    <release version="1.1.0" date="2017-06-22">
      Updated device support files to V5.1.3.
      Updated Flash Algorithms to 5.2.0.
      Updated SVD files to V5.2.1.
      Updated emlib, emdrv to V5.1.3.
      Updated documentation.
      Added new devices.
    </release>
    <release version="1.0.0" date="2016-04-22">
      Initial Release version of EFM32JG1B Device Family Pack.
      Device support files to V4.2.1.
      emlib, emdrv to V4.2.1.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFM32JG1B</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFM32JG1B Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="38400000"/>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <book name="Documents/DUI0552A_cortex_m3_dgug.pdf"  title="Cortex-M3 Generic User Guide"/>
      <book name="Documents/EFM32JG1-ReferenceManual.pdf" title="EFM32JG1 Reference Manual"/>
      <book name="Documents/efm32jg1-datasheet.pdf"       title="EFM32JG1 Data Sheet"/>

      <description>
Silicon Labs' EFM32™ Jade Gecko features a powerful 32-bit ARM® Cortex®-M3 and a wide selection of peripherals, including a unique cryptographic hardware engine supporting AES, ECC, and SHA.
These features, combined with ultra-low current active mode and short wake-up time from energy-saving modes, make the Jade Gecko family of microcontrollers well suited for any battery-powered application, as well as other systems requiring high performance and low-energy consumption.
      </description>

      <!-- ************************  Subfamily 'EFM32JG1B200'  **************************** -->
      <subFamily DsubFamily="EFM32JG1B200">

        <!-- *************************  Device 'EFM32JG1B200F256GM48'  ***************************** -->
        <device Dname="EFM32JG1B200F256GM48">
          <compile header="Device/EFM32JG1B/Include/em_device.h"  define="EFM32JG1B200F256GM48"/>
          <debug svd="SVD/EFM32JG1B/EFM32JG1B200F256GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32JG1B200F256IM48'  ***************************** -->
        <device Dname="EFM32JG1B200F256IM48">
          <compile header="Device/EFM32JG1B/Include/em_device.h"  define="EFM32JG1B200F256IM48"/>
          <debug svd="SVD/EFM32JG1B/EFM32JG1B200F256IM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32JG1B200F128GM48'  ***************************** -->
        <device Dname="EFM32JG1B200F128GM48">
          <compile header="Device/EFM32JG1B/Include/em_device.h"  define="EFM32JG1B200F128GM48"/>
          <debug svd="SVD/EFM32JG1B/EFM32JG1B200F128GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32JG1B200F256GM32'  ***************************** -->
        <device Dname="EFM32JG1B200F256GM32">
          <compile header="Device/EFM32JG1B/Include/em_device.h"  define="EFM32JG1B200F256GM32"/>
          <debug svd="SVD/EFM32JG1B/EFM32JG1B200F256GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32JG1B200F256IM32'  ***************************** -->
        <device Dname="EFM32JG1B200F256IM32">
          <compile header="Device/EFM32JG1B/Include/em_device.h"  define="EFM32JG1B200F256IM32"/>
          <debug svd="SVD/EFM32JG1B/EFM32JG1B200F256IM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32JG1B200F128GM32'  ***************************** -->
        <device Dname="EFM32JG1B200F128GM32">
          <compile header="Device/EFM32JG1B/Include/em_device.h"  define="EFM32JG1B200F128GM32"/>
          <debug svd="SVD/EFM32JG1B/EFM32JG1B200F128GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32JG1B100'  **************************** -->
      <subFamily DsubFamily="EFM32JG1B100">
  
        <!-- *************************  Device 'EFM32JG1B100F256GM32'  ***************************** -->
        <device Dname="EFM32JG1B100F256GM32">
          <compile header="Device/EFM32JG1B/Include/em_device.h"  define="EFM32JG1B100F256GM32"/>
          <debug svd="SVD/EFM32JG1B/EFM32JG1B100F256GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32JG1B100F256IM32'  ***************************** -->
        <device Dname="EFM32JG1B100F256IM32">
          <compile header="Device/EFM32JG1B/Include/em_device.h"  define="EFM32JG1B100F256IM32"/>
          <debug svd="SVD/EFM32JG1B/EFM32JG1B100F256IM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32JG1B100F128GM32'  ***************************** -->
        <device Dname="EFM32JG1B100F128GM32">
          <compile header="Device/EFM32JG1B/Include/em_device.h"  define="EFM32JG1B100F128GM32"/>
          <debug svd="SVD/EFM32JG1B/EFM32JG1B100F128GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32JG1B">
      <description>Silicon Labs EFM32JG1B devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32JG1B*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32JG1B CMSIS">
      <description>Silicon Labs EFM32JG1B devices, CMSIS Core</description>
      <require condition="EFM32JG1B"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + Compiler Conditions -->
    <condition id="EFM32JG1B CMSIS GCC">
      <description>Silicon Labs EFM32JG1B devices, CMSIS Core, GCC compiler</description>
      <require condition="EFM32JG1B CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32JG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32JG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
